<a href="https://colab.research.google.com/github/LucasVale98/Formacao_Data_Science/blob/main/Python_Pandas_Tratando_e_analisando_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **01. Importando Dados**

**Importando a base**

In [ ]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')
path = '/content/drive/My Drive/datasets/alura_curssos/Python Pandas Tratando e analisando dados'

Mounted at /content/drive

In [ ]:
dados = pd.read_csv(path + '/aluguel.csv', sep=";")

In [ ]:
type(dados)

pandas.core.frame.DataFrame

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19831 entries, 0 to 19830
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Tipo           19831 non-null  object
 1   Bairro         19831 non-null  object
 2   Quartos        19831 non-null  int64
 3   Vagas          19831 non-null  int64
 4   Suites         19831 non-null  int64
 5   Area           19831 non-null  int64
 6   Valor          19831 non-null  float64
 7   Condominio     19831 non-null  float64
 8   IPTU           19831 non-null  float64
 9   Valor m2       19831 non-null  float64
 10  Tipo Agregado  19831 non-null  object
dtypes: float64(4), int64(4), object(3)
memory usage: 1.7+ MB

In [ ]:
dados.head()

          Tipo               Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0  Apartamento               Centro        1  ...  20.0     53.33    Apartamento
1  Apartamento         Higienópolis        1  ...   0.0     16.67    Apartamento
2  Apartamento             Cachambi        2  ...  17.0     26.00    Apartamento
3  Apartamento               Grajaú        2  ...  74.0     21.43    Apartamento
4  Apartamento  Lins de Vasconcelos        3  ...  14.0     16.67    Apartamento

[5 rows x 11 columns]

**Conhecendo a base de dados**

In [ ]:
dados.dtypes

Tipo              object
Bairro            object
Quartos            int64
Vagas              int64
Suites             int64
Area               int64
Valor            float64
Condominio       float64
IPTU             float64
Valor m2         float64
Tipo Agregado     object
dtype: object

In [ ]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns=["Tipos de Dados"])
tipos_de_dados

              Tipos de Dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [ ]:
tipos_de_dados.columns.name = "Variáveis"
tipos_de_dados

Variáveis     Tipos de Dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [ ]:
dados.shape

(19831, 11)

In [ ]:
print(f"A base de Dados apresenta: {dados.shape[0]} registros (Imóveis) e  {dados.shape[1]} variáveis")

A base de Dados apresenta: 19831 registros (Imóveis) e  11 variáveis

# **02. Series e Index**

**Removendo valores repetidos**

In [ ]:
dados.head()

          Tipo               Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0  Apartamento               Centro        1  ...  20.0     53.33    Apartamento
1  Apartamento         Higienópolis        1  ...   0.0     16.67    Apartamento
2  Apartamento             Cachambi        2  ...  17.0     26.00    Apartamento
3  Apartamento               Grajaú        2  ...  74.0     21.43    Apartamento
4  Apartamento  Lins de Vasconcelos        3  ...  14.0     16.67    Apartamento

[5 rows x 11 columns]

In [ ]:
dados["Tipo"]

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
            ...
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [ ]:
tipo_de_imovel = dados["Tipo"]

In [ ]:
type(tipo_de_imovel)

pandas.core.series.Series

In [ ]:
tipo_de_imovel.unique()

array(['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila',
       'Quitinete'], dtype=object)

In [ ]:
tipo_de_imovel.drop_duplicates(inplace=True)

In [ ]:
tipo_de_imovel

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

**Redefinindo o index**

In [ ]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)

In [ ]:
tipo_de_imovel

                     Tipo
0             Apartamento
16923                Casa
17821  Casa de Condomínio
18785        Casa de Vila
19018           Quitinete

In [ ]:
tipo_de_imovel.index

Int64Index([0, 16923, 17821, 18785, 19018], dtype='int64')

In [ ]:
tipo_de_imovel.shape[0]

5

In [ ]:
range(tipo_de_imovel.shape[0])

range(0, 5)

In [ ]:
for x in range(tipo_de_imovel.shape[0]):
  print(x)

0
1
2
3
4

In [ ]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])

In [ ]:
tipo_de_imovel

                 Tipo
0         Apartamento
1                Casa
2  Casa de Condomínio
3        Casa de Vila
4           Quitinete

In [ ]:
tipo_de_imovel.columns.name = "Id"

In [ ]:
tipo_de_imovel

Id                Tipo
0          Apartamento
1                 Casa
2   Casa de Condomínio
3         Casa de Vila
4            Quitinete

# **03. Filtrando Dados**

**Imóveis residenciais**

In [ ]:
dados.head()

          Tipo               Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0  Apartamento               Centro        1  ...  20.0     53.33    Apartamento
1  Apartamento         Higienópolis        1  ...   0.0     16.67    Apartamento
2  Apartamento             Cachambi        2  ...  17.0     26.00    Apartamento
3  Apartamento               Grajaú        2  ...  74.0     21.43    Apartamento
4  Apartamento  Lins de Vasconcelos        3  ...  14.0     16.67    Apartamento

[5 rows x 11 columns]

In [ ]:
list(dados["Tipo"].drop_duplicates())

['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila', 'Quitinete']

In [ ]:
residencial = ['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila', 'Quitinete']
print(residencial)

['Apartamento', 'Casa', 'Casa de Condomínio', 'Casa de Vila', 'Quitinete']

In [ ]:
selecao = dados["Tipo"].isin(residencial).head(10)
print(selecao)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: Tipo, dtype: bool

# **04 Tratamdo de dados Faltantes**

**Tirando valores nulos**

In [ ]:
dados = pd.read_excel(path + '/aluguel.xlsx')

In [ ]:
dados.head()

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN

[5 rows x 9 columns]

In [ ]:
dados.isnull().head()

    Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0  False   False    False  False   False  False  False       False  False
1  False   False    False  False   False  False  False        True   True
2  False   False    False  False   False  False  False       False  False
3  False   False    False  False   False  False  False       False  False
4  False   False    False  False   False  False  False       False   True

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        10 non-null     object
 1   Bairro      10 non-null     object
 2   Quartos     10 non-null     int64
 3   Vagas       10 non-null     int64
 4   Suites      10 non-null     int64
 5   Area        10 non-null     int64
 6   Valor       10 non-null     int64
 7   Condominio  6 non-null      float64
 8   IPTU        5 non-null      float64
dtypes: float64(2), int64(5), object(2)
memory usage: 848.0+ bytes

In [ ]:
dados["Valor"].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Valor, dtype: bool

In [ ]:
dados[dados["Valor"].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [ ]:
A = dados.shape[0]
dados.dropna(subset= {"Valor"}, inplace=True)
B = dados.shape[0]
print(A - B)

0

**Tratamento condicional**

In [ ]:
dados[dados["Condominio"].isnull()].shape[0]

4

In [ ]:
selecao = (dados["Tipo"] == "Apartamento") & (dados["Condominio"].isnull())

In [ ]:
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
print(A - B)

9

In [ ]:
dados[dados["Condominio"].isnull()].shape[0]

1

In [ ]:
dados = dados.fillna({"Condominio": 0, "IPTU": 0})

In [ ]:
dados[dados["Condominio"].isnull()].shape[0]

0

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 5 to 5
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        1 non-null      object
 1   Bairro      1 non-null      object
 2   Quartos     1 non-null      int64
 3   Vagas       1 non-null      int64
 4   Suites      1 non-null      int64
 5   Area        1 non-null      int64
 6   Valor       1 non-null      int64
 7   Condominio  1 non-null      float64
 8   IPTU        1 non-null      float64
dtypes: float64(2), int64(5), object(2)
memory usage: 80.0+ bytes

# **07. Novas Variáveis**

**Criando novas variáveis**

In [ ]:
dados = pd.read_excel(path + '/aluguel.xlsx')

In [ ]:
dados.head()

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN

[5 rows x 9 columns]

In [ ]:
dados["Valor Bruto"] = dados["Valor"] + dados["Condominio"] + dados["IPTU"]

In [ ]:
dados.head()

                      Tipo           Bairro  ...    IPTU  Valor Bruto
0                Quitinete       Copacabana  ...    60.0       2260.0
1                     Casa  Jardim Botânico  ...     NaN          NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...  1111.0      10331.0
3              Apartamento           Centro  ...    20.0       1210.0
4              Apartamento     Higienópolis  ...     NaN          NaN

[5 rows x 10 columns]

In [ ]:
dados["Valor m2"] = dados["Valor"] / dados["Area"]

In [ ]:
dados.head()

                      Tipo           Bairro  ...  Valor Bruto   Valor m2
0                Quitinete       Copacabana  ...       2260.0  42.500000
1                     Casa  Jardim Botânico  ...          NaN  70.000000
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      10331.0  34.666667
3              Apartamento           Centro  ...       1210.0  53.333333
4              Apartamento     Higienópolis  ...          NaN  16.666667

[5 rows x 11 columns]

In [ ]:
dados["Valor m2"] = dados["Valor m2"].round(2)

In [ ]:
dados.head()

                      Tipo           Bairro  ...  Valor Bruto  Valor m2
0                Quitinete       Copacabana  ...       2260.0     42.50
1                     Casa  Jardim Botânico  ...          NaN     70.00
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      10331.0     34.67
3              Apartamento           Centro  ...       1210.0     53.33
4              Apartamento     Higienópolis  ...          NaN     16.67

[5 rows x 11 columns]

In [ ]:
dados["Valor Bruto m2"] = (dados["Valor"] / dados["Area"]).round()

In [ ]:
dados.head()

                      Tipo           Bairro  ...  Valor m2  Valor Bruto m2
0                Quitinete       Copacabana  ...     42.50            42.0
1                     Casa  Jardim Botânico  ...     70.00            70.0
2  Conjunto Comercial/Sala  Barra da Tijuca  ...     34.67            35.0
3              Apartamento           Centro  ...     53.33            53.0
4              Apartamento     Higienópolis  ...     16.67            17.0

[5 rows x 12 columns]